tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/portable-ruby"

tap "beeftornado/rmtree"
tap "cantino/mcfly"
tap "heroku/brew"
tap "jmacdonald/amp"
tap "linuxbrew/xorg"
tap "rafaelgarrido/caveats"
tap "rs/tap"

brew "alerter"
brew "antigen"
brew "openssl@1.1"
brew "python@3.9"
brew "asciinema"
brew "bat"
brew "glib"
brew "pkg-config"
brew "dprint"
brew "exa"
brew "fd"
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gradle"
brew "hexyl"
brew "hugo"
brew "hyperfine"
brew "jql"
brew "keychain"
brew "krb5"
brew "libusb"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "neovim"
brew "nmap"
brew "node"
brew "perl"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "subversion"
brew "tealdeer"
brew "trash-cli"
brew "xh"
brew "xxhash"
brew "youtube-dl"
brew "zellij"
brew "zoxide"
brew "zsh"


brew "cantino/mcfly/mcfly"
brew "heroku/brew/heroku"
brew "jmacdonald/amp/amp"
brew "rafaelgarrido/caveats/brew-caveats"

cask "bitwarden"
cask "brave-browser"
cask "cakebrew"
cask "discord"
cask "font-cascadia-code"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "mactex"
cask "netnewswire"
cask "ngrok"
cask "open-in-code"
cask "protonvpn"
cask "signal"
cask "syncthing"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
