tap "beeftornado/rmtree"
tap "cantino/mcfly"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jmacdonald/amp"
tap "linuxbrew/xorg"
tap "rafaelgarrido/caveats"
tap "rs/tap"
brew "openssl@1.1"
brew "libxml2"
brew "zsh"
brew "antigen"
brew "python@3.9"
brew "asciinema"
brew "pkg-config"
brew "bat"
brew "glib"
brew "krb5"
brew "dprint"
brew "exa"
brew "fd"
brew "gcc"
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "libusb"
brew "gnupg"
brew "gradle"
brew "hexyl"
brew "hugo"
brew "hyperfine"
brew "jql"
brew "keychain"
brew "libxslt"
brew "llvm", link: false
brew "neovim"
brew "nmap"
brew "node"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "rustup-init"
brew "sd"
brew "starship"
brew "tealdeer"
brew "trash-cli"
brew "valgrind"
brew "xh"
brew "xxhash"
brew "youtube-dl"
brew "zellij"
brew "zoxide"
brew "cantino/mcfly/mcfly"
brew "jmacdonald/amp/amp"
brew "rafaelgarrido/caveats/brew-caveats"
