<?xml version="1.0" encoding="utf-8"?>
<packages>
  <package id="auto-dark-mode" version="3.0.1" />
  <package id="autohotkey.portable" version="1.1.33.09" />
  <package id="brave" version="1.25.73" />
  <package id="choco-upgrade-all-at" version="0.0.6" />
  <package id="chocolatey" version="0.10.15" />
  <package id="chocolatey-core.extension" version="1.3.5.1" />
  <package id="chocolatey-dotnetfx.extension" version="1.0.1" />
  <package id="chocolatey-windowsupdate.extension" version="1.0.4" />
  <package id="chocolateygui" version="0.18.1" />
  <package id="discord" version="1.0.9002" />
  <package id="discord.install" version="1.0.9002" />
  <package id="docker-desktop" version="3.4.0" />
  <package id="DotNet4.5.2" version="4.5.2.20140902" />
  <package id="dotnet4.6.2" version="4.6.01590.20190822" />
  <package id="dotnetfx" version="4.8.0.20190930" />
  <package id="GoogleChrome" version="91.0.4472.106" />
  <package id="gpg4win" version="3.1.16" />
  <package id="iTunes" version="12.11.3.17" />
  <package id="KB2919355" version="1.0.20160915" />
  <package id="KB2919442" version="1.0.20160915" />
  <package id="KB2999226" version="1.0.20181019" />
  <package id="KB3033929" version="1.0.5" />
  <package id="KB3035131" version="1.0.3" />
  <package id="kdeconnect-kde" version="21.04.2.619" />
  <package id="netfx-4.6.2" version="4.6.2.20190930" />
  <package id="nmap" version="7.80" />
  <package id="protonvpn" version="1.20.4" />
  <package id="signal" version="5.4.1" />
  <package id="vcredist140" version="14.29.30037" />
  <package id="vlc" version="3.0.15" />
  <package id="zoom" version="5.6.6.961" />
</packages>