tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"

tap "adoptopenjdk/openjdk"
tap "badabing2005/pixelflasher"
tap "beeftornado/rmtree"
tap "d99kris/nchat"
tap "heroku/brew"
tap "hybras/tap"
tap "linuxbrew/xorg"
tap "louisbrunner/valgrind"
tap "rafaelgarrido/caveats"
tap "robotsandpencils/made"
tap "rs/tap"

brew "act"
brew "actionlint"
brew "libunistring"
brew "glib"
brew "jpeg-turbo"
brew "icu4c@76"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "age"
brew "jpeg-xl"
brew "aom"
brew "apr"
brew "apr-util"
brew "aria2"
brew "asciidoctor"
brew "asciinema"
brew "dbus"
brew "atomicparsley"
brew "bash"
brew "bat"
brew "bats-core"
brew "node"
brew "bitwarden-cli"
brew "black", restart_service: true
brew "xxhash"
brew "chezmoi"
brew "clang-format"
brew "cocoapods"
brew "lima"
brew "colima"
brew "curl"
brew "diff-so-fancy"
brew "diffoscope"
brew "direnv"
brew "pkgconf"
brew "gobject-introspection"
brew "python@3.9"
brew "gtk4"
brew "libadwaita"
brew "dissent"
brew "dos2unix"
brew "dprint"
brew "dust"
brew "expat"
brew "eza"
brew "fd"
brew "unbound", restart_service: true
brew "libass"
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "libusb"
brew "gnupg"
brew "libheif"
brew "graphicsmagick"
brew "graphviz"
brew "gtk+3"
brew "gtksourceview3"
brew "hadolint"
brew "helix"
brew "perl"
brew "hexyl"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jq"
brew "jql"
brew "just"
brew "keychain"
brew "krb5"
brew "libsoup"
brew "libxml2"
brew "libxslt"
brew "llm"
brew "llvm"
brew "llvm@17"
brew "macos-trash"
brew "mas"
brew "mcfly"
brew "mkcert"
brew "mosh"
brew "nasm"
brew "neovim"
brew "nim"
brew "nmap"
brew "nushell"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "procs"
brew "pygit2"
brew "ripgrep"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "sniffnet"
brew "socat"
brew "solargraph"
brew "spim"
brew "starship"
brew "subversion"
brew "ta-lib"
brew "tccutil"
brew "tealdeer"
brew "tokei"
brew "uv"
brew "virtualenv"
brew "watchexec"
brew "wget"
brew "xcodes", link: false
brew "xh"
brew "yasm"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "d99kris/nchat/nchat", args: ["without-telegram"]
brew "heroku/brew/heroku"
brew "hybras/tap/homebrew-createzap"
brew "hybras/tap/pijul"
brew "hybras/tap/sshpass"
brew "hybras/tap/svg-term-cli"
brew "rafaelgarrido/caveats/brew-caveats"

cask "font-b612-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-computer-modern"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jsmath-cmex10"
cask "font-jsmath-cmmi10"
cask "font-jsmath-cmr10"
cask "font-jsmath-cmsy10"
cask "font-sauce-code-pro-nerd-font"

cask "airmessage"
cask "alacritty"
cask "alt-tab"
cask "altserver"
cask "android-platform-tools"
cask "apparency"
cask "bartender"
cask "browserosaurus"
cask "bwana"
cask "discord"
cask "dteoh-devdocs"
cask "finicky"
cask "firefox"
cask "flameshot"
cask "freetube"
cask "gitfinder"
cask "google-chrome"
cask "iina"
cask "jellyfin"
cask "karabiner-elements"
cask "kdeconnect@nightly"
cask "kextviewr"
cask "lapce"
cask "launchcontrol"
cask "maccy"
cask "mimestream"
cask "mullvadvpn"
cask "netnewswire"
cask "nightfall"
cask "pixelflasher"
cask "protonvpn"
cask "proxyman"
cask "pulse"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "scroll-reverser"
cask "servo"
cask "sloth"
cask "stats"
cask "steam"
cask "stolendata-mpv"
cask "suspicious-package"
cask "tailscale", args: { appdir: "/Applications" }
cask "thunderbird"
cask "timer"
cask "tor-browser"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "warp"
cask "webpquicklook"
cask "whoozle-android-file-transfer"
cask "xcodes"
cask "xquartz"
cask "yubico-yubikey-manager"
cask "zed"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Discovery", id: 1381004916
mas "OTP Manager", id: 928941247
mas "Shazam", id: 897118787
mas "Step Two", id: 1448916662
mas "Wayback Machine", id: 1472432422
mas "WireGuard", id: 1451685025
