tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"

tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "cantino/mcfly"
tap "heroku/brew"
tap "hybras/tap"
tap "jmacdonald/amp"
tap "jzelinskie/duckdns"
tap "linuxbrew/xorg"
tap "louisbrunner/valgrind"
tap "rafaelgarrido/caveats"
tap "robotsandpencils/made"
tap "rs/tap"

brew "act"
brew "age"
brew "alerter"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "asciinema"
brew "atomicparsley"
brew "bat"
brew "bfg"
brew "node"
brew "bitwarden-cli"
brew "black", restart_service: true
brew "caddy"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "chezmoi"
brew "clang-format"
brew "container-diff"
brew "curl"
brew "dbus"
brew "dhall"
brew "diff-so-fancy"
brew "diffoscope"
brew "dos2unix"
brew "dprint"
brew "dust"
brew "exa"
brew "fd"
brew "unbound", restart_service: true
brew "harfbuzz"
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gitless"
brew "libusb"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphicsmagick"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "hexyl"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "jql"
brew "just"
brew "keychain"
brew "krb5"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "macos-trash"
brew "mas"
brew "mkcert"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nushell"
brew "ocaml"
brew "opam"
brew "openblas"
brew "perl"
brew "pinentry-mac"
brew "podman"
brew "procs"
brew "r"
brew "ripgrep"
brew "ruby", link: true
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "solargraph"
brew "spim"
brew "starship"
brew "subversion"
brew "tealdeer"
brew "tokei"
brew "virtualenv"
brew "wget"
brew "xh"
brew "xxhash"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "cantino/mcfly/mcfly"
brew "heroku/brew/heroku"
brew "hybras/tap/homebrew-createzap"
brew "hybras/tap/pijul"
brew "hybras/tap/sshpass"
brew "jmacdonald/amp/amp"
brew "rafaelgarrido/caveats/brew-caveats"

cask_args appdir: "~/Applications", require_sha: true

cask "font-caskaydia-cove-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"

cask "airmessage"
cask "alacritty"
cask "alt-tab"
cask "android-platform-tools"
cask "apparency"
cask "betterdiscord-installer"
cask "bonjeff"
cask "browserosaurus"
cask "cakebrew"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "docker"
cask "dteoh-devdocs"
cask "finicky"
cask "gitfinder"
cask "google-chrome"
cask "iina"
cask "intellij-idea"
cask "iridium"
cask "karabiner-elements"
cask "kdeconnect-nightly"
cask "minecraft"
cask "netnewswire"
cask "ngrok"
cask "nightfall"
cask "obs"
cask "openbci"
cask "protonvpn"
cask "proxyman"
cask "pulse"
cask "qlprettypatch"
cask "qtspim"
cask "quicklook-csv"
cask "quicklook-json"
cask "raspberry-pi-imager"
cask "rectangle"
cask "rstudio"
cask "scroll-reverser"
cask "shrugs"
cask "signal"
cask "steam"
cask "suspicious-package"
cask "syncthing"
cask "tailscale", args: { appdir: "/Applications" }
cask "tor-browser"
cask "vlc"
cask "vscodium"
cask "webpquicklook"
cask "whoozle-android-file-transfer"
cask "xquartz"

mas "Amphetamine", id: 937984704
mas "Discovery", id: 1381004916
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
