tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"

tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "cantino/mcfly"
tap "heroku/brew"
tap "hybras/tap"
tap "jmacdonald/amp"
tap "linuxbrew/xorg"
tap "louisbrunner/valgrind"
tap "rafaelgarrido/caveats"
tap "robotsandpencils/made"
tap "rs/tap"

brew "act"
brew "adwaita-icon-theme"
brew "age"
brew "alerter"
brew "aom"
brew "apr"
brew "apr-util"
brew "aria2"
brew "asciinema"
brew "atomicparsley"
brew "bash"
brew "bat"
brew "bats-core"
brew "bitwarden-cli"
brew "black", restart_service: true
brew "chezmoi"
brew "clang-format"
brew "container-diff"
brew "curl"
brew "dark-mode"
brew "dbus"
brew "diff-so-fancy"
brew "diffoscope"
brew "direnv"
brew "dos2unix"
brew "dprint"
brew "dust"
brew "entr"
brew "exa"
brew "expat"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gitless"
brew "glib"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gopls"
brew "graphicsmagick"
brew "graphviz"
brew "gtk4"
brew "gtksourceview3"
brew "hadolint"
brew "harfbuzz"
brew "helix"
brew "hexyl"
brew "hyperfine"
brew "imagemagick"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "jql"
brew "just"
brew "keychain"
brew "krb5"
brew "libass"
brew "librsvg"
brew "libsodium"
brew "libunistring"
brew "libusb"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "macos-trash"
brew "mas"
brew "meson"
brew "mkcert"
brew "mosh"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nushell"
brew "ocaml"
brew "opam"
brew "openblas"
brew "pandoc"
brew "pango"
brew "perl"
brew "pinentry-mac"
brew "pkg-config"
brew "poetry"
brew "procs"
brew "python@3.9"
brew "r"
brew "ripgrep"
brew "rubberband"
brew "rust"
brew "rust-analyzer"
brew "rustfmt"
brew "rustup-init"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "solargraph"
brew "spim"
brew "starship"
brew "staticcheck"
brew "subversion"
brew "tealdeer"
brew "tokei"
brew "unbound", restart_service: true
brew "virtualenv"
brew "watchexec"
brew "wget"
brew "xcodes"
brew "xh"
brew "xxhash"
brew "yasm"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"

brew "cantino/mcfly/mcfly"
brew "heroku/brew/heroku"
brew "hybras/tap/gtkcord4"
brew "hybras/tap/homebrew-createzap"
brew "hybras/tap/pijul"
brew "hybras/tap/sshpass"
brew "jmacdonald/amp/amp"
brew "rafaelgarrido/caveats/brew-caveats"

cask "font-caskaydia-cove-nerd-font"
cask "font-computer-modern"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jsmath-cmex10"
cask "font-jsmath-cmmi10"
cask "font-jsmath-cmr10"
cask "font-jsmath-cmsy10"
cask "font-sauce-code-pro-nerd-font"

cask "airmessage"
cask "alacritty"
cask "alt-tab"
cask "android-platform-tools"
cask "apparency"
cask "betterdiscord-installer"
cask "bonjeff"
cask "browserosaurus"
cask "bwana"
cask "cakebrew"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "dteoh-devdocs"
cask "fig"
cask "finicky"
cask "firefox"
cask "flameshot"
cask "freetube"
cask "gitfinder"
cask "google-chrome"
cask "iina"
cask "intellij-idea"
cask "kextviewr"
cask "launchcontrol"
cask "maccy"
cask "minecraft"
cask "mullvadvpn"
cask "netnewswire"
cask "ngrok"
cask "nightfall"
cask "protonvpn"
cask "proxyman"
cask "pulse"
cask "qlprettypatch"
cask "qtspim"
cask "quicklook-csv"
cask "quicklook-json"
cask "racket"
cask "raspberry-pi-imager"
cask "rectangle"
cask "rstudio"
cask "scroll-reverser"
cask "shrugs"
cask "signal"
cask "sloth"
cask "spectacle"
cask "stats"
cask "steam"
cask "suspicious-package"
cask "syncthing"
cask "tailscale", args: { appdir: "/Applications" }
cask "thunderbird"
cask "timer"
cask "tor-browser"
cask "transmission"
cask "umd-vpn"
cask "vlc"
cask "vscodium"
cask "warp"
cask "webcord"
cask "webpquicklook"
cask "whalebird"
cask "whoozle-android-file-transfer"
cask "xquartz"

mas "Amphetamine", id: 937984704
mas "Dark Night", id: 1592844577
mas "Discovery", id: 1381004916
mas "Mastonaut", id: 1450757574
mas "OTP Manager", id: 928941247
mas "Shazam", id: 897118787
mas "Step Two", id: 1448916662
mas "Wake Up Time", id: 495945638
mas "WireGuard", id: 1451685025
