tap "homebrew/autoupdate"
tap "homebrew/command-not-found"
tap "homebrew/portable-ruby"
tap "homebrew/test-bot"

tap "adoptopenjdk/openjdk"
tap "badabing2005/pixelflasher"
tap "beeftornado/rmtree"
tap "d99kris/nchat"
tap "heroku/brew"
tap "hybras/tap"
tap "linuxbrew/xorg"
tap "louisbrunner/valgrind"
tap "robotsandpencils/made"
tap "rs/tap"

brew "act"
brew "shellcheck"
brew "actionlint"
brew "libunistring"
brew "glib"
brew "jpeg-turbo"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "age"
brew "jpeg-xl"
brew "aom"
brew "apr"
brew "apr-util"
brew "aria2"
brew "asciidoctor"
brew "asciinema"
brew "dbus", restart_service: :changed
brew "atomicparsley"
brew "bash"
brew "bat"
brew "bats-core"
brew "node"
brew "bitwarden-cli"
brew "brew-caveats"
brew "xxhash"
brew "chezmoi"
brew "clang-format"
brew "lima"
brew "colima"
brew "curl"
brew "dark-mode-notify", args: ["HEAD"], restart_service: :changed
brew "diff-so-fancy"
brew "expat"
brew "diffoscope"
brew "direnv"
brew "pkgconf"
brew "gobject-introspection"
brew "python@3.9"
brew "gtk4"
brew "libadwaita"
brew "dissent"
brew "dos2unix"
brew "dprint"
brew "dust"
brew "eslint"
brew "eza"
brew "fd"
brew "unbound", restart_service: :changed
brew "libass"
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "libusb"
brew "gnupg"
brew "goreleaser"
brew "libheif"
brew "graphicsmagick"
brew "icu4c@76"
brew "graphviz"
brew "gtk+3"
brew "gtksourceview3"
brew "hadolint"
brew "helix"
brew "perl"
brew "hexyl"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jq"
brew "jql"
brew "just"
brew "keychain"
brew "krb5"
brew "libsoup"
brew "libxml2"
brew "libxslt"
brew "llm"
brew "llvm"
brew "llvm@17"
brew "macos-trash", link: true
brew "mas"
brew "mcfly"
brew "micro"
brew "mkcert"
brew "mosh"
brew "nasm"
brew "neovim"
brew "nim"
brew "nmap"
brew "nushell"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "procs"
brew "pygit2"
brew "ripgrep"
brew "ruby-lsp"
brew "ruby@3.3"
brew "sd"
brew "sheldon"
brew "shfmt"
brew "sniffnet"
brew "socat"
brew "solargraph"
brew "spim"
brew "starship"
brew "subversion"
brew "ta-lib"
brew "tccutil"
brew "tealdeer"
brew "tokei"
brew "uv"
brew "virtualenv"
brew "watchexec"
brew "wget"
brew "xcodes", link: false
brew "xh"
brew "yasm"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "d99kris/nchat/nchat", args: ["without-telegram"]
brew "heroku/brew/heroku"
brew "hybras/tap/brewfile-format"
brew "hybras/tap/homebrew-createzap"
brew "hybras/tap/pijul"
brew "hybras/tap/sshpass"
brew "hybras/tap/svg-term-cli"

cask_args appdir: "~/Applications"

cask "font-b612-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-computer-modern"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jsmath-cmex10"
cask "font-jsmath-cmmi10"
cask "font-jsmath-cmr10"
cask "font-jsmath-cmsy10"
cask "font-sauce-code-pro-nerd-font"

cask "airmessage"
cask "alacritty"
cask "alt-tab"
cask "altserver"
cask "android-platform-tools"
cask "apparency"
cask "bartender"
cask "browserosaurus"
cask "bwana"
cask "discord"
cask "dteoh-devdocs"
cask "finicky"
cask "firefox"
cask "flameshot"
cask "freetube"
cask "ghostty"
cask "gitfinder"
cask "google-chrome"
cask "iina"
cask "jellyfin"
cask "karabiner-elements"
cask "kdeconnect@nightly"
cask "kextviewr"
cask "lapce"
cask "launchcontrol"
cask "maccy"
cask "mimestream"
cask "mullvadvpn"
cask "netnewswire"
cask "nightfall"
cask "openmtp"
cask "pixelflasher"
cask "protonvpn"
cask "proxyman"
cask "pulse"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "ripcord"
cask "scroll-reverser"
cask "sloth"
cask "stats"
cask "steam"
cask "steamcmd"
cask "stolendata-mpv"
cask "suspicious-package"
cask "tailscale", args: { appdir: "/Applications" }
cask "thunderbird"
cask "timer"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "voxa"
cask "vscodium"
cask "warp"
cask "webpquicklook"
cask "whoozle-android-file-transfer"
cask "xcodes"
cask "xquartz"
cask "zed"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Discovery", id: 1381004916
mas "Numbers", id: 409203825
mas "OTP Manager", id: 928941247
mas "Shazam", id: 897118787
mas "Step Two", id: 1448916662
mas "Wayback Machine", id: 1472432422
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025

vscode "13xforever.language-x86-64-assembly"
vscode "ahnafnafee.postscript-preview"
vscode "alefragnani.project-manager"
vscode "anan.devdocstab"
vscode "arahata.linter-actionlint"
vscode "asciidoctor.asciidoctor-vscode"
vscode "belfz.search-crates-io"
vscode "bierner.docs-view"
vscode "bierner.emojisense"
vscode "bierner.markdown-mermaid"
vscode "bmuskalla.vscode-tldr"
vscode "budparr.language-hugo-vscode"
vscode "caponetto.vscode-diff-viewer"
vscode "castwide.solargraph"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "davidwang.ini-for-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dprint.dprint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "eliostruyf.vscode-hugo-themer"
vscode "eriksik2.vscode-ghci"
vscode "evzen-wybitul.magic-racket"
vscode "exiasr.hadolint"
vscode "fivethree.vscode-hugo-snippets"
vscode "fnando.linter"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "humao.rest-client"
vscode "jetmartin.bats"
vscode "jinliming2.vscode-go-template"
vscode "jnoortheen.nix-ide"
vscode "justusadam.language-haskell"
vscode "kaellarkin.hugo-shortcode-syntax"
vscode "kdarkhan.mips"
vscode "kevinkassimo.cargo-toml-snippets"
vscode "kokakiwi.vscode-just"
vscode "lextudio.restructuredtext"
vscode "liximomo.sftp"
vscode "lkrms.inifmt"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathematic.vscode-pdf"
vscode "matthewpi.caddyfile-support"
vscode "maximedenes.vscoq"
vscode "meowcolm024.has-go"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mikecunneen.cunneen-vscode-plist"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "mogeko.haskell-extension-pack"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mxschmitt.postscript"
vscode "naco-siren.gradle-language"
vscode "nathanridley.autotrim"
vscode "npxms.hide-gitignored"
vscode "ocamllabs.ocaml-platform"
vscode "pbkit.vscode-pbkit"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ruoz.coq"
vscode "rusnasonov.vscode-hugo"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "sethpoulsen.vscode-language-pyret"
vscode "shengchen.vscode-checkstyle"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "skellock.just"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tintinweb.graphviz-interactive-preview"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "ultram4rine.vscode-choosealicense"
vscode "vadimcn.vscode-lldb"
vscode "vasilescur.better-mips"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vtrois.gitmoji-vscode"
vscode "withfig.fig"
vscode "zh9528.file-size"
vscode "ziyasal.vscode-open-in-github"
