tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"

tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "cantino/mcfly"
tap "heroku/brew"
tap "hybras/tap"
tap "jmacdonald/amp"
tap "linuxbrew/xorg"
tap "louisbrunner/valgrind"
tap "nrlquaker/createzap"
tap "rafaelgarrido/caveats"
tap "robotsandpencils/made"
tap "rs/tap"

brew "alerter"
brew "jpeg-xl"
brew "aom"
brew "openssl@1.1"
brew "asciinema"
brew "atomicparsley"
brew "bat"
brew "node"
brew "python@3.9"
brew "bitwarden-cli"
brew "glib"
brew "pkg-config"
brew "chezmoi"
brew "clang-format"
brew "dhall"
brew "docker"
brew "docker-machine", restart_service: true
brew "dos2unix"
brew "dprint"
brew "dust"
brew "exa"
brew "fd"
brew "unbound", restart_service: true
brew "libsodium"
brew "rubberband"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "openjdk"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "hexyl"
brew "hugo"
brew "hyperfine"
brew "jql"
brew "just"
brew "keychain"
brew "krb5"
brew "libusb"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "macos-trash"
brew "mas"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "nushell"
brew "ocaml"
brew "opam"
brew "openblas"
brew "perl"
brew "pinentry-mac"
brew "podman"
brew "procs"
brew "r"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "rustup-init"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "spim"
brew "starship"
brew "subversion"
brew "tealdeer"
brew "wget"
brew "xh"
brew "xxhash"
brew "youtube-dl"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "cantino/mcfly/mcfly"
brew "heroku/brew/heroku"
brew "hybras/tap/sshpass"
brew "jmacdonald/amp/amp"
brew "rafaelgarrido/caveats/brew-caveats"
brew "robotsandpencils/made/xcodes"

cask_args appdir: "~/Applications", require_sha: true

cask "font-cascadia-code"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro-for-powerline"

cask "adoptopenjdk16"
cask "alacritty"
cask "betterdiscord-installer"
cask "bluestacks"
cask "bonjeff"
cask "brave-browser"
cask "browserosaurus"
cask "cakebrew"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "docker"
cask "dteoh-devdocs"
cask "finicky"
cask "gitfinder"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "netnewswire"
cask "ngrok"
cask "openbci"
cask "protonvpn"
cask "proxyman"
cask "pulse"
cask "qlprettypatch"
cask "qtspim"
cask "quicklook-csv"
cask "quicklook-json"
cask "rstudio"
cask "scroll-reverser"
cask "signal"
cask "steam"
cask "suspicious-package"
cask "syncthing"
cask "tor-browser"
cask "vlc"
cask "vscodium"
cask "webpquicklook"
cask "whoozle-android-file-transfer"
cask "xcodes"
cask "xquartz"
cask "zoom"

# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Xcode", id: 497799835
